# 두 모집단 A, B
A <- c(79.98, 80.04, 80.02, 80.04, 80.03, 80.03, 80.04, 79.97,
            80.05, 80.03, 80.02, 80.00, 80.02)

B <- c(80.02, 79.94, 79.98, 79.97, 79.97, 80.03, 79.95, 79.97)

length(A)
length(B)

# 두 모집단 모두 정규분포임을 가정 
boxplot(A, B) 

# two-sample t-test 3가지 가정
# 독립성, 정규성, 등분상성 
# 등분산성을 알려주려면 var.equal=T 옵션 설정
t.test(A, B, var.equal = T)

# df = n1 + n2 -2 = (n1-1) + (n2-1)
t.test(A, B) # unequal 이 default값. 
# 신뢰구간, 자유도 달라진다. 


############ 쌍체 비교 ############
# 아스피린 복용 전후 혈압의 변화
x <- c(70, 80, 72, 76, 76, 76, 72, 78, 82, 64, 74, 92, 74, 68, 84)
y <- c(68, 72, 62, 70, 58, 66, 68, 52, 64, 72, 74, 60, 74, 72, 74)

length(x)
length(y)

# method1
t.test(x,y,paired = T, conf.level = 0.95)

# method2 (one-sample로 계산된다.)
d <- x-y
t.test(d)


############ 모비율 비교 
prop.test (x=c(88,126), n=c(100,150)) #x에는 X, Y 두 모집단의 시행횟수, n은 성공횟수 

