# =========================
# 기술 통계 연습문제 p.39
# =========================

# 1. 
v1 <- c(14,7,3,9,13)
v2 <- c(12, 14, 18, 15, 12)
v3 <- c(1,0,11,2,12,8)
v4 <- c(-2,1,-3,0,3,2,-1)

mean(v4)
median(v4)
var(v4)
sd(v4)  

# 2. 

ex.air <- c(9, 12, 18, 14, 12, 14, 12, 10, 16, 
            11, 9, 11, 13, 11, 13, 15, 13, 14)

mean(ex.air)
sd(ex.air)
median(ex.air)

quantile(ex.air)

iqr <- IQR(ex.air)
iqr/2

# 6. scatter

height <- c(167, 165, 162, 167, 160, 163, 168, 
            175, 157, 170, 172, 164, 171, 174)

weight <- c(66, 65, 64, 68, 61, 59, 67, 
            70, 60, 65, 67, 64, 62, 63)

df <- data.frame(height, weight)

# 산점도 
scatter.smooth(df)
plot(weight, height, main = "Scatter Plot")
cor(weight, height)


# 표본 상관계수 

x <- c(2.8, 2.5, 3.2, 1.8, 1.6, 3.6, 2.7, 3.0, 1.5, 3.3, 
       3.1, 2.9, 3.8, 3.2, 2.6, 3.5, 3.3, 2.7, 2.0, 1.8)

y <- c(52, 53, 62, 43, 50, 69, 55, 59, 33, 64, 
       62, 58, 75, 63, 53, 69, 66, 53, 45, 40)

cor(x, y)

# 표본 변동계수

sample <- c(14, 21, 29, 33, 40, 45, 49, 50, 52, 67)

sd(sample)/mean(sample)







