# =========================
# 기술 통계 연습문제 p.39
# =========================

# 1. 
v1 <- c(14,7,3,9,13)
v2 <- c(12, 14, 18, 15, 12)
v3 <- c(1,0,11,2,12,8)
v4 <- c(-2,1,-3,0,3,2,-1)

mean(v4)
median(v4)
var(v4)
sd(v4)  

# 2. 

ex.air <- c(9, 12, 18, 14, 12, 14, 12, 10, 16, 
            11, 9, 11, 13, 11, 13, 15, 13, 14)

mean(ex.air)
sd(ex.air)
median(ex.air)

quantile(ex.air)

iqr <- IQR(ex.air)
iqr/2

# 6. scatter

height <- c(167, 165, 162, 167, 160, 163, 168, 
            175, 157, 170, 172, 164, 171, 174)

weight <- c(66, 65, 64, 68, 61, 59, 67, 
            70, 60, 65, 67, 64, 62, 63)

df <- data.frame(height, weight)

# 산점도 
scatter.smooth(df)
plot(weight, height, main = "Scatter Plot")
cor(weight, height)


# 표본 상관계수 

x <- c(2.8, 2.5, 3.2, 1.8, 1.6, 3.6, 2.7, 3.0, 1.5, 3.3, 
       3.1, 2.9, 3.8, 3.2, 2.6, 3.5, 3.3, 2.7, 2.0, 1.8)

y <- c(52, 53, 62, 43, 50, 69, 55, 59, 33, 64, 
       62, 58, 75, 63, 53, 69, 66, 53, 45, 40)

cor(x, y)

# 표본 변동계수

sample <- c(14, 21, 29, 33, 40, 45, 49, 50, 52, 67)

sd(sample)/mean(sample)


# =========================
# 표본 평균 연습문제 p.123
# =========================

# 1.
X = 1/6 
X_1 = 1/6, X_2 = 1/6 

X_1의 평균 : 1/6
X_2 : 1/6 

prop.dice <- c(1/6, 1/6)
df <- data.frame(prop.dice)
dotplot(df)




# 2. 

x <- rnorm(16, 20, 8)
x.mean <- mean(x)
x.sd <- sd(x)

# (1) 0.4012937
pnorm(18, mean = x.mean , sd=x.sd)

# (2) 0.3538302
1 - pnorm(23, mean = x.mean , sd=x.sd)

# (3) 0.1484446
p_21 <- 1 - pnorm(21, mean = x.mean , sd=x.sd)
p_18 <- 1 - pnorm(18, mean = 20, sd=8)

p_18 - p_21

# 3. 
N(168, 5^2)
n = 25 
평균 신장의 표준편차? 5/5 = 1 
n=100일 때 5/10 = 0.5 


# 4. 0.8185
x.mean <- 40
x.sd <- 18/6 
x.sd 

p_34 <- pnorm(34, x.mean, x.sd)
p_34
p_43 <- 1 - pnorm(43, x.mean, x.sd)
p_43
1- (p_34 + p_43)

# 5.

# (1) 841개
x <- pnorm(940, 900, 40)
x 

# (2) 0.1056498 
40/10 = 4
y <- 1- pnorm(905, 900, 4)
y

# 6.

# (1) 
# (2) 
# (3)  
# (4)  

qchisq(0.005, 4) # a = 0.995
qchisq(0.025, 4) # a = 0.975

qchisq(0.95, 4) # 상위 5% 
qchisq(0.90, 9) # 상위 10%
qchisq(0.025, 16) # 하위 2.5%
qchisq(0.01, 8) # 하위 1%

# 7. 

# (1) 0.004535297
dchisq(7.4338, 20) # 0.005

# (2) 0.01210365
dchisq(31.4104, 20) # 0.05

# (3) 0.75
p_95 <- dchisq(9.5908, 20) # 0.025
p_95
p_28 <- dchisq(28.4120, 20) # 0.9 
p_28
p_28 - p_95


# 8. 
t.test()